Week8/A_SwissCheeseFlow/Aa_flowSwissCheeseIco/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.1;

vertices
(
    (0 0 0)
    (1 0 0)
    (1 1 0)
    (0 1 0)
    (0 0 5)
    (1 0 5)
    (1 1 5)
    (0 1 5)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (10 10 50) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    left
    {
        type patch;
        faces
        (
            (0 3 2 1)
        );
    }
    right
    {
        type patch;
        faces
        (
            (4 5 6 7)
        );
    }
    outside
    {
        type patch;
        faces
        (
            (0 4 7 3)
            (0 1 5 4)
            (1 2 6 5)
            (2 3 7 6)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
